x=input('Дата фильма: сегодня или завтра?')
x1=input('Какой фильм?')
x3=input('На какое время?')
x4=int(input('Косичество билетов:'))
if x == 'сегодня'and x1 == 'Пятница' and x3 == '12' and x4<20:
    print('Стоимость {} рублей'.format(x4*250))
if x == 'завтра' and x1 == 'Пятница' and x3 == '12' and x4<20:
    print('Стоимость {} рублей'.format(x4*250*0.95))
if x == 'сегодня' and x1 == 'Пятница' and x3 == '12' and x4>=20:
    print('Стоимость {} рублей'.format(x4*250*0.8))
if x == 'завтра' and x1 == 'Пятница' and x3 == '12' and x4>=20:
    print('Стоимость {} рублей'.format(x4*250*0.8*0.95))
if x == 'сегодня'and x1 == 'Пятница' and x3 == '16' and x4<20:
    print('Стоимость {} рублей'.format(x4*350))
if x == 'завтра' and x1 == 'Пятница' and x3 == '16' and x4<20:
    print('Стоимость {} рублей'.format(x4*350*0.95))
if x == 'сегодня' and x1 == 'Пятница' and x3 == '16' and x4>=20:
    print('Стоимость {} рублей'.format(x4*350*0.8))
if x == 'завтра' and x1 == 'Пятница' and x3 == '16' and x4>=20:
    print('Стоимость {} рублей'.format(x4*350*0.8*0.95))
if x == 'сегодня'and x1 == 'Пятница' and x3 == '20' and x4<20:
    print('Стоимость {} рублей'.format(x4*450))
if x == 'завтра' and x1 == 'Пятница' and x3 == '20' and x4<20:
    print('Стоимость {} рублей'.format(x4*450*0.95))
if x == 'сегодня' and x1 == 'Пятница' and x3 == '20' and x4>=20:
    print('Стоимость {} рублей'.format(x4*450*0.8))
if x == 'завтра' and x1 == 'Пятница' and x3 == '20' and x4>=20:
    print('Стоимость {} рублей'.format(x4*450*0.8*0.95))
if x == 'сегодня'and x1 == 'Чемпионы' and x3 == '10' and x4<20:
    print('Стоимость {} рублей'.format(x4*250))
if x == 'завтра' and x1 == 'Чемпионы' and x3 == '10' and x4<20:
    print('Стоимость {} рублей'.format(x4*250*0.95))
if x == 'сегодня' and x1 == 'Чемпионы' and x3 == '10' and x4>=20:
    print('Стоимость {} рублей'.format(x4*250*0.8))
if x == 'завтра' and x1 == 'Чемпионы' and x3 == '10' and x4>=20:
    print('Стоимость {} рублей'.format(x4*250*0.8*0.95))
if x == 'сегодня'and x1 == 'Чемпионы' and x3 == '13' and x4<20:
    print('Стоимость {} рублей'.format(x4*350))
if x == 'завтра' and x1 == 'Чемпионы' and x3 == '13' and x4<20:
    print('Стоимость {} рублей'.format(x4*350*0.95))
if x == 'сегодня' and x1 == 'Чемпионы' and x3 == '13' and x4>=20:
    print('Стоимость {} рублей'.format(x4*350*0.8))
if x == 'завтра' and x1 == 'Чемпионы' and x3 == '13' and x4>=20:
    print('Стоимость {} рублей'.format(x4*350*0.8*0.95))
if x == 'сегодня'and x1 == 'Чемпионы' and x3 == '16' and x4<20:
    print('Стоимость {} рублей'.format(x4*350))
if x == 'завтра' and x1 == 'Чемпионы' and x3 == '16' and x4<20:
    print('Стоимость {} рублей'.format(x4*350*0.95))
if x == 'сегодня' and x1 == 'Чемпионы' and x3 == '16' and x4>=20:
    print('Стоимость {} рублей'.format(x4*350*0.8))
if x == 'завтра' and x1 == 'Чемпионы' and x3 == '16' and x4>=20:
    print('Стоимость {} рублей'.format(x4*350*0.8*0.95))
if x == 'сегодня'and x1 == 'Пернатая банда' and x3 == '10' and x4<20:
    print('Стоимость {} рублей'.format(x4*350))
if x == 'завтра' and x1 == 'Пернатая банда' and x3 == '10' and x4<20:
    print('Стоимость {} рублей'.format(x4*350*0.95))
if x == 'сегодня' and x1 == 'Пернатая банда' and x3 == '10' and x4>=20:
    print('Стоимость {} рублей'.format(x4*350*0.8))
if x == 'завтра' and x1 == 'Пернатая банда' and x3 == '10' and x4>=20:
    print('Стоимость {} рублей'.format(x4*350*0.8*0.95))
if x == 'сегодня'and x1 == 'Пернатая банда' and x3 == '14' and x4<20:
    print('Стоимость {} рублей'.format(x4*450))
if x == 'завтра' and x1 == 'Пернатая банда' and x3 == '14' and x4<20:
    print('Стоимость {} рублей'.format(x4*450*0.95))
if x == 'сегодня' and x1 == 'Пернатая банда' and x3 == '14' and x4>=20:
    print('Стоимость {} рублей'.format(x4*450*0.8))
if x == 'завтра' and x1 == 'Пернатая банда' and x3 == '14' and x4>=20:
    print('Стоимость {} рублей'.format(x4*450*0.8*0.95))
if x == 'сегодня'and x1 == 'Пернатая банда' and x3 == '18' and x4<20:
    print('Стоимость {} рублей'.format(x4*450))
if x == 'завтра' and x1 == 'Пернатая банда' and x3 == '18' and x4<20:
    print('Стоимость {} рублей'.format(x4*450*0.95))
if x == 'сегодня' and x1 == 'Пернатая банда' and x3 == '18' and x4>=20:
    print('Стоимость {} рублей'.format(x4*450*0.8))
if x == 'завтра' and x1 == 'Пернатая банда' and x3 == '18' and x4>=20:
    print('Стоимость {} рублей'.format(x4*450*0.8*0.95))






